tap "mobile-dev-inc/tap"
tap "sinelaw/fresh"
brew "aria2"
brew "atuin"
brew "autojump"
brew "carapace"
brew "ccusage"
brew "chezmoi"
brew "clang-format"
brew "cocoapods"
brew "fzf"
brew "gh"
brew "ghq"
brew "googleworkspace-cli"
brew "imagemagick"
brew "mise"
brew "openjdk@21"
brew "pipx"
brew "pnpm"
brew "poppler"
brew "postgresql@18"
brew "sheldon"
brew "starship"
brew "swiftlint"
brew "uv"
brew "xcodes"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "mobile-dev-inc/tap/maestro"
brew "sinelaw/fresh/fresh"
cask "android-studio"
cask "arc"
cask "caffeine"
cask "claude"
cask "claude-code"
cask "clipy"
cask "codex"
cask "cursor"
cask "dropbox"
cask "font-cica"
cask "font-jetbrains-mono-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "keeper-password-manager"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "thebrowsercompany-dia"
cask "warp"
cask "xcodes-app"
cask "zoom"
