tap "mobile-dev-inc/tap"
tap "sinelaw/fresh"
brew "aria2"
brew "atuin"
brew "carapace"
brew "ccusage"
brew "chezmoi"
brew "clang-format"
brew "cocoapods"
brew "fd"
brew "fzf"
brew "gh"
brew "ghq"
brew "googleworkspace-cli"
brew "imagemagick"
brew "mise"
brew "openjdk@21"
brew "pipx"
brew "pnpm"
brew "poppler"
brew "postgresql@18"
brew "sheldon"
brew "starship"
brew "swiftlint"
brew "uv"
brew "xcodes"
brew "zoxide"
brew "mobile-dev-inc/tap/maestro"
brew "sinelaw/fresh/fresh"
cask "android-studio"
cask "arc"
cask "caffeine"
cask "claude"
cask "claude-code"
cask "clipy"
cask "codex"
cask "cursor"
cask "dropbox"
cask "font-jetbrains-mono-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "keeper-password-manager"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "thebrowsercompany-dia"
cask "xcodes-app"
cask "zoom"
vscode "anthropic.claude-code"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "eamodio.gitlens"
vscode "expo.vscode-expo-tools"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "yoavbls.pretty-ts-errors"
cargo "bat"
cargo "filetree"
cargo "keifu"
cargo "tmux-shortcut-helper"
cargo "zellij"
